#define _CRT_SECURE_NO_WARNINGS
#define STATIC_BY_BASE(Value) (QWORD)(GameModule.ModBase + Value)

#include "Common.h"
#include "imgui/imgui.hpp"
#include "imgui/imgui_impl_win32.hpp"
#include "imgui/imgui_impl_dx11.hpp"
#include "CRC32.h"
#include "Offsets.h"
#include "Math.h"
#include "SDK.h"
#include "Core.h"
#include "Overlay/Overlay.h"
#include "set.h"
#include "kdmapper.hpp"
#include "Lolicore.h"
#undef max
#define VECTOR(Vector) Vector.X, Vector.Y, Vector.Z

/*
* class worldData
{
public:
	char pad_0000[3400]; //0x0000
	uint64_t bulletTable; //0x0D48
	uint32_t bulletTableSize; //0x0D50
	char pad_0D54[316]; //0x0D54
	uint64_t nearAnimalTable; //0x0E90
	uint32_t nearAnimalTableSize; //0x0E98
	char pad_0E9C[316]; //0x0E9C
	uint64_t farAnimalTable; //0x0FD8
	uint32_t farAnimalTableSize; //0x0FE0
	char pad_0FE4[3932]; //0x0FE4
	uint64_t slowAnimalTable; //0x1F40
	uint32_t slowAnimalTableSize; //0x1F48
	char pad_1F4C[68]; //0x1F4C
	uint64_t itemTable; //0x1F90
	uint32_t itemTableSize; //0x1F98
	char pad_1F9C[2292]; //0x1F9C
	uint64_t cameraOn; //0x2890
	char pad_2898[2032]; //0x2898
}; //Size: 0x3088
*/


// float AIM_FOV = 50.f;

struct GlobalData_t
{
	QWORD m_World = 0x0;
//	QWORD m_Camera = 0x0;
	QWORD m_NetworkClient = 0x0;
	QWORD m_WinEngine = 0x0;

	QWORD m_dwOffsetEntitySkeleton = 0x0;
	QWORD m_dwOffsetEntitySimpleSkeleton = 0x0;

	QWORD m_dwFrequencyPtr = 0x0;
};

GlobalData_t Globals = {};

void SpeedHack()
{
	static DWORD64 m_dwOriginalFrequency = Driver.Read<DWORD_PTR>(Globals.m_dwFrequencyPtr);
	if (!m_dwOriginalFrequency)
		return;

//	TRACE("[FACE] [DBG] m_dwOriginalFrequency: %d", m_dwOriginalFrequency);

	static bool m_bWasEnabled = false;

	if (GetAsyncKeyState(VK_LMENU))
	{
		float m_flSpeed = 2.f; // 1.0f -> 30.0f
		if (m_flSpeed < 1.0f)
			m_flSpeed = 1.0f;
		if (m_flSpeed > 3.0f)
			m_flSpeed = 3.0f;

		DWORD64 NewFreq = static_cast<DWORD64>((float)(m_dwOriginalFrequency) * 1.2);

		Driver.Write<DWORD_PTR>(Globals.m_dwFrequencyPtr, NewFreq);
